## 신세계다 ㅋㅋㅋㅋㅋㅋㅋㅋ
## 빈 다이아 중간 공백 몇 개 출력해야 하느냐
## abs_i: abs(i), i: index, c3: 중간공백 수, n: 몇 줄짜리 다이아
df1 <- data.frame(
  abs_i= c(3,2,1,0,1,2,3),
  i= c(3,2,1,0,-1,-2,-3),
  c3= c(0,1,3,5,3,1,0),
  n= c(7,7,7,7,7,7,7)
)
# n= 7일 때
df2 <- data.frame(
  abs_i= c(2,1,0,1,2),
  i= c(2,1,0,-1,-2),
  c3= c(1,3,5,3,1),
  n= c(7,7,7,7,7)
)
# n= 5일 때
df3_5 <- data.frame(
  abs_i= c(1,0,1),
  i= c(1,0,-1),
  c3= c(1,3,1),
  n= c(5,5,5)
)

df1
df2
df3_5
lm(c3~., df2)
lm(c3~abs_i, df2)
lm(c3~., df3_5)
lm(c3~abs_i, df3_5)
